zzzz1121/A-dream/src/microduino_core_esp32_test/main.cpp
#include <Arduino.h>
#include <WiFi.h>
#include <esp_now.h>
#include <esp_wifi.h>
#include <esp_dmx.h>
#include <esp_arduino_version.h>

#define BOARD_NAME "Microduino Core ESP32"
#define DEVICE_ROLE "micController"
#define MIC_CONTROLLER_VERSION "0.1.3"

#define SERIAL_BAUD 115200
#define ESPNOW_CHANNEL 1
#define DREAM_PACKET_MAGIC 0x44524541UL
#define DREAM_PROTOCOL_VERSION 1

#define EEG_TIMEOUT_MS 3000
#define POOR_SIGNAL_BAD_THRESHOLD 120
#define DMX_REFRESH_MS 50
#define STATUS_SEND_MS 500
#define STATUS_PRINT_MS 1000

#define DMX_PORT DMX_NUM_1
#define DMX_TX_PIN 5
#define DMX_RX_PIN -1
#define DMX_EN_PIN -1
#define DMX_LIGHT_1_ADDRESS 1
#define DMX_LIGHT_2_ADDRESS 5
#define DREAM_DMX_BOOT_SELF_TEST 1
#define LIGHT_FLOW_STEP_MS 90
#define LIGHT_FLOW_OFFSET 96
#define LIGHT_SMOOTH_TARGET_PERCENT 6
#define LIGHT_SATURATION_PERCENT 65

// Keep EEG automatic linkage scoped to lights. Stepper remains available for manual bench tuning only.
#define DREAM_ENABLE_EEG_STEPPER_AUTO 0
#define DREAM_ENABLE_EEG_RELAY_AUTO 0

// Stepper output is enabled for bench tuning. Relay outputs drive the fogger and fan boards.
#define DREAM_ENABLE_STEPPER_OUTPUT 1
#define DREAM_ENABLE_RELAY_OUTPUT 1

#define BUBBLE_DEFAULT_FOG_START_AT_MS 1000
#define BUBBLE_DEFAULT_FAN_LIGHT_START_AT_MS 5000
#define BUBBLE_DEFAULT_FORWARD_START_AT_MS 9000
#define BUBBLE_DEFAULT_FOG_STOP_AT_MS 12700
#define BUBBLE_DEFAULT_FAN_STOP_AT_MS 13700
#define BUBBLE_DEFAULT_LIGHT_STOP_AT_MS 16700

#if DREAM_ENABLE_STEPPER_OUTPUT
#define STEPPER_STEP_PIN 25
#define STEPPER_DIR_PIN 14
#define STEPPER_DIR_INVERT 0
#define STEPPER_TARGET_LEFT 0x01
#define STEPPER_TARGET_RIGHT 0x02
#define STEPPER_TARGET_BOTH (STEPPER_TARGET_LEFT | STEPPER_TARGET_RIGHT)
#define STEPPER_TARGET_SINGLE STEPPER_TARGET_LEFT
#define STEPPER_ENABLE_PIN -1
#define STEPPER_ENABLE_ACTIVE_LEVEL LOW
#define STEPPER_STEPS_PER_REV 1600
#define STEPPER_PULSE_HALF_PERIOD_US 1000
#define STEPPER_MIN_POSITION_STEPS -320000
#define STEPPER_MAX_POSITION_STEPS 320000
#define STEPPER_MAX_COMMAND_STEPS 64000
#define STEPPER_ATTENTION_THRESHOLD 70
#define STEPPER_MEDITATION_THRESHOLD 65
#endif

#if DREAM_ENABLE_RELAY_OUTPUT
#define FOG_RELAY_PIN 26
#define FAN_RELAY_PIN 27
#define RELAY_ACTIVE_LEVEL HIGH
#endif

#if DREAM_ENABLE_STEPPER_OUTPUT
#define BUBBLE_DEFAULT_FORWARD_STEPS STEPPER_STEPS_PER_REV
#define BUBBLE_DEFAULT_REVERSE_STEPS STEPPER_STEPS_PER_REV
#else
#define BUBBLE_DEFAULT_FORWARD_STEPS 1600
#define BUBBLE_DEFAULT_REVERSE_STEPS 1600
#endif

const uint8_t BROADCAST_MAC[] = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF};
const uint8_t EEG_NOT_WORN_SIGNALS[] = {0x1D, 0x36, 0x37, 0x38, 0x50, 0x51, 0x52, 0x6B, 0xC8};

enum DreamPacketType : uint8_t {
  DREAM_PACKET_EEG = 1,
  DREAM_PACKET_MIC_STATUS = 2,
  DREAM_PACKET_CONTROL = 3,
};

enum DreamPacketFlags : uint8_t {
  EEG_FLAG_SIGNAL_OK = 1 << 0,
  EEG_FLAG_SOURCE_TIMEOUT = 1 << 1,
  EEG_FLAG_CHECKSUM_OK = 1 << 2,
};

enum DreamLightMode : uint8_t {
  LIGHT_OFF,
  LIGHT_IDLE,
  LIGHT_EEG_BLEND,
  LIGHT_SIGNAL_BAD,
  LIGHT_TIMEOUT,
  LIGHT_MANUAL,
};

enum DreamStepperState : uint8_t {
  STEPPER_DISABLED,
  STEPPER_IDLE,
  STEPPER_MOVING,
  STEPPER_BREATHING,
  STEPPER_LIMITED,
  STEPPER_FAULT,
};

enum DreamRelayState : uint8_t {
  RELAY_OFF,
  RELAY_ARMING,
  RELAY_ON,
  RELAY_COOLDOWN,
  RELAY_FAULT,
};

enum DreamBubbleState : uint8_t {
  BUBBLE_IDLE,
  BUBBLE_REVERSE_PULL,
  BUBBLE_FOG_ON,
  BUBBLE_BLOW_OUT,
  BUBBLE_FORWARD_RESET,
  BUBBLE_FOG_HOLD,
  BUBBLE_WIND_DOWN,
  BUBBLE_LIGHT_HOLD,
};

enum DreamBubbleStepperPhase : uint8_t {
  BUBBLE_STEPPER_NONE,
  BUBBLE_STEPPER_REVERSE,
  BUBBLE_STEPPER_FORWARD,
};

enum DreamSafetyState : uint8_t {
  SAFETY_NORMAL,
  SAFETY_SIGNAL_BAD,
  SAFETY_LINK_TIMEOUT,
  SAFETY_ESTOP,
  SAFETY_FAULT,
};

enum DreamControlAction : uint8_t {
  CONTROL_NONE,
  CONTROL_SYSTEM_ENABLE,
  CONTROL_SYSTEM_DISABLE,
  CONTROL_LIGHT_AUTO,
  CONTROL_LIGHT_COLOR,
  CONTROL_LIGHT_OFF,
  CONTROL_RELAY_ON,
  CONTROL_RELAY_OFF,
  CONTROL_STEPPER_FORWARD,
  CONTROL_STEPPER_BACKWARD,
  CONTROL_STEPPER_STOP,
  CONTROL_ALL_STOP,
  CONTROL_FAN_ON,
  CONTROL_FAN_OFF,
  CONTROL_BUBBLE_TRIGGER,
  CONTROL_BUBBLE_CONFIG,
};

struct __attribute__((packed)) DreamEegEspNowPacket {
  uint32_t magic;
  uint16_t version;
  uint8_t type;
  uint8_t flags;
  uint32_t seq;
  uint32_t pcTimeMs;
  uint32_t m5UptimeMs;
  uint8_t poorSignal;
  uint8_t attention;
  uint8_t meditation;
  uint8_t reserved;
  uint32_t eegPower[8];
  uint16_t checksum;
};

struct __attribute__((packed)) DreamMicStatusPacket {
  uint32_t magic;
  uint16_t version;
  uint8_t type;
  uint8_t flags;
  uint32_t seq;
  uint32_t uptimeMs;
  uint32_t lastEegSeq;
  uint32_t eegAgeMs;
  uint32_t rxCount;
  uint32_t dropCount;
  uint32_t timeoutCount;
  uint8_t poorSignal;
  uint8_t attention;
  uint8_t meditation;
  uint8_t lightLevel;
  uint8_t lightMode;
  uint8_t light1R;
  uint8_t light1G;
  uint8_t light1B;
  uint8_t light1W;
  uint8_t light2R;
  uint8_t light2G;
  uint8_t light2B;
  uint8_t light2W;
  uint8_t stepperState;
  uint8_t relayState;
  uint8_t safetyState;
  uint32_t controlRxCount;
  uint8_t lastControlAction;
  uint8_t manualLightEnabled;
  uint8_t relayOutputEnabled;
  uint8_t stepperOutputEnabled;
  uint8_t systemEnabled;
  uint8_t fanState;
  uint8_t bubbleState;
  uint8_t bubbleOutputEnabled;
  uint8_t reserved2;
  uint32_t bubbleTriggerCount;
  uint32_t bubbleActiveMs;
  uint16_t checksum;
};

struct __attribute__((packed)) DreamControlEspNowPacket {
  uint32_t magic;
  uint16_t version;
  uint8_t type;
  uint8_t flags;
  uint32_t seq;
  uint32_t pcTimeMs;
  uint32_t m5UptimeMs;
  uint8_t action;
  uint8_t reserved;
  uint16_t arg1;
  uint16_t arg2;
  uint16_t arg3;
  uint16_t arg4;
  uint16_t arg5;
  uint16_t arg6;
  uint16_t arg7;
  uint16_t arg8;
  uint16_t checksum;
};

struct BubbleFlowConfig {
  uint16_t reverseSteps;
  uint16_t fogStartAtMs;
  uint16_t fanLightStartAtMs;
  uint16_t forwardStartAtMs;
  uint16_t forwardSteps;
  uint16_t fogStopAtMs;
  uint16_t fanStopAtMs;
  uint16_t lightStopAtMs;
};

struct RgbwColor {
  uint8_t r;
  uint8_t g;
  uint8_t b;
  uint8_t w;
};

DreamEegEspNowPacket latestEegPacket = {};
byte dmxData[DMX_PACKET_SIZE] = {};

RgbwColor light1Current = {};
RgbwColor light2Current = {};
RgbwColor light1Target = {};
RgbwColor light2Target = {};
const RgbwColor BLUE_PURPLE_FLOW_BASE = {0x4B, 0x7D, 0xFF, 0};
const RgbwColor BLUE_PURPLE_FLOW_BLUE = {0x24, 0x5C, 0xFF, 0};

uint32_t eegRxCount = 0;
uint32_t eegDropCount = 0;
uint32_t eegChecksumErrorCount = 0;
uint32_t eegTimeoutCount = 0;
uint32_t controlRxCount = 0;
uint32_t controlChecksumErrorCount = 0;
uint32_t statusSeq = 0;
uint32_t lastEegFrameMs = 0;
uint32_t lastDmxRefreshMs = 0;
uint32_t lastStatusSendMs = 0;
uint32_t lastStatusPrintMs = 0;
uint32_t dmxFrameCount = 0;
uint32_t dmxSendFailCount = 0;
uint32_t dmxWaitFailCount = 0;
size_t lastDmxWriteSize = 0;
size_t lastDmxSendSize = 0;
uint8_t lightMode = LIGHT_OFF;
uint8_t lightLevel = 0;
uint8_t stepperState = STEPPER_DISABLED;
uint8_t relayState = RELAY_OFF;
uint8_t fanState = RELAY_OFF;
uint8_t bubbleState = BUBBLE_IDLE;
uint8_t safetyState = SAFETY_LINK_TIMEOUT;
uint8_t lastControlAction = CONTROL_NONE;
uint8_t lastAppliedControlActionForDedup = CONTROL_NONE;
uint32_t lastAppliedControlSeq = 0;
uint32_t lastAppliedControlPcTimeMs = 0;
bool espNowReady = false;
bool haveEeg = false;
bool haveAppliedControlPacket = false;
bool timeoutWasActive = false;
bool systemEnabled = false;
bool manualLightEnabled = false;
bool autoLightReleased = false;
RgbwColor manualLightColor = {};
uint32_t bubbleStateStartMs = 0;
uint32_t bubbleStartMs = 0;
uint32_t bubbleFogStartMs = 0;
uint32_t bubbleFanStartMs = 0;
uint32_t bubbleForwardStartMs = 0;
uint32_t bubbleForwardDoneMs = 0;
uint32_t bubbleFogStopMs = 0;
uint32_t bubbleReverseDoneMs = 0;
uint32_t bubbleTriggerCount = 0;
bool bubbleStepperMoving = false;
uint8_t bubbleStepperPhase = BUBBLE_STEPPER_NONE;
BubbleFlowConfig bubbleConfig = {
  BUBBLE_DEFAULT_REVERSE_STEPS,
  BUBBLE_DEFAULT_FOG_START_AT_MS,
  BUBBLE_DEFAULT_FAN_LIGHT_START_AT_MS,
  BUBBLE_DEFAULT_FORWARD_START_AT_MS,
  BUBBLE_DEFAULT_FORWARD_STEPS,
  BUBBLE_DEFAULT_FOG_STOP_AT_MS,
  BUBBLE_DEFAULT_FAN_STOP_AT_MS,
  BUBBLE_DEFAULT_LIGHT_STOP_AT_MS,
};

