zzzz1121/A-dream/src/microduino_core_esp32_test/main.cpp
#if DREAM_ENABLE_RELAY_OUTPUT
bool manualFogRequested = false;
bool manualFanRequested = false;
#endif

#if DREAM_ENABLE_STEPPER_OUTPUT
int32_t stepperPositionSteps = 0;
int32_t stepperTargetSteps = 0;
int32_t manualStepperTargetSteps = 0;
int32_t bubbleStepperTargetSteps = 0;
uint32_t lastStepperPulseUs = 0;
bool stepperPulseActive = false;
bool stepperBreathForward = true;
bool manualStepperActive = false;
uint8_t manualStepperMask = 0;
#endif

uint16_t packetChecksum(const uint8_t *data, size_t length) {
  uint32_t sum = 0;
  for (size_t i = 0; i < length; i++) {
    sum += data[i];
  }
  return static_cast<uint16_t>(sum & 0xFFFF);
}

template <typename Packet>
uint16_t calculatePacketChecksum(const Packet &packet) {
  return packetChecksum(reinterpret_cast<const uint8_t *>(&packet), sizeof(Packet) - sizeof(uint16_t));
}

uint8_t scalePercentToByte(uint8_t value) {
  return static_cast<uint8_t>(constrain(static_cast<int>(value), 0, 100) * 255 / 100);
}

uint8_t max4(uint8_t a, uint8_t b, uint8_t c, uint8_t d) {
  return max(max(a, b), max(c, d));
}

uint8_t softenSaturationChannel(uint8_t channel, uint8_t peak) {
  return static_cast<uint8_t>(
    peak - (static_cast<uint16_t>(peak - channel) * LIGHT_SATURATION_PERCENT + 50) / 100);
}

RgbwColor softenSaturation(const RgbwColor &color) {
  const uint8_t peak = max(max(color.r, color.g), color.b);
  return {
    softenSaturationChannel(color.r, peak),
    softenSaturationChannel(color.g, peak),
    softenSaturationChannel(color.b, peak),
    color.w,
  };
}

uint8_t smoothChannel(uint8_t current, uint8_t target) {
  return static_cast<uint8_t>(
    (static_cast<uint16_t>(current) * (100 - LIGHT_SMOOTH_TARGET_PERCENT) +
     static_cast<uint16_t>(target) * LIGHT_SMOOTH_TARGET_PERCENT + 50) / 100);
}

RgbwColor smoothColor(const RgbwColor &current, const RgbwColor &target) {
  return {
    smoothChannel(current.r, target.r),
    smoothChannel(current.g, target.g),
    smoothChannel(current.b, target.b),
    smoothChannel(current.w, target.w),
  };
}

bool isColorOff(const RgbwColor &color) {
  return color.r == 0 && color.g == 0 && color.b == 0 && color.w == 0;
}

bool isEegSignalBad(uint8_t poorSignal) {
  if (poorSignal > POOR_SIGNAL_BAD_THRESHOLD) {
    return true;
  }

  for (uint8_t i = 0; i < sizeof(EEG_NOT_WORN_SIGNALS); i++) {
    if (poorSignal == EEG_NOT_WORN_SIGNALS[i]) {
      return true;
    }
  }

  return false;
}

RgbwColor scaleRgbColor(uint8_t r, uint8_t g, uint8_t b, uint8_t brightness) {
  return {
    static_cast<uint8_t>(static_cast<uint16_t>(r) * brightness / 255),
    static_cast<uint8_t>(static_cast<uint16_t>(g) * brightness / 255),
    static_cast<uint8_t>(static_cast<uint16_t>(b) * brightness / 255),
    0,
  };
}

RgbwColor colorWheel(uint8_t position, uint8_t brightness) {
  position = 255 - position;
  if (position < 85) {
    return scaleRgbColor(255 - position * 3, 0, position * 3, brightness);
  }
  if (position < 170) {
    position -= 85;
    return scaleRgbColor(0, position * 3, 255 - position * 3, brightness);
  }
  position -= 170;
  return scaleRgbColor(position * 3, 255 - position * 3, 0, brightness);
}

void setFlowTargets(uint8_t brightness, uint8_t phaseOffset = 0) {
  const uint8_t phase = static_cast<uint8_t>((millis() / LIGHT_FLOW_STEP_MS + phaseOffset) & 0xFF);
  light1Target = colorWheel(phase, brightness);
  light2Target = colorWheel(static_cast<uint8_t>(phase + LIGHT_FLOW_OFFSET), brightness);
}

uint8_t triangleWave(uint8_t phase) {
  return phase < 128 ? static_cast<uint8_t>(phase * 2) : static_cast<uint8_t>((255 - phase) * 2);
}

uint8_t mixChannel(uint8_t a, uint8_t b, uint8_t amount) {
  return static_cast<uint8_t>((static_cast<uint16_t>(a) * (255 - amount) + static_cast<uint16_t>(b) * amount + 127) / 255);
}

RgbwColor blendColor(const RgbwColor &a, const RgbwColor &b, uint8_t amount) {
  return {
    mixChannel(a.r, b.r, amount),
    mixChannel(a.g, b.g, amount),
    mixChannel(a.b, b.b, amount),
    mixChannel(a.w, b.w, amount),
  };
}

RgbwColor scaleColor(const RgbwColor &color, uint8_t brightness) {
  return {
    static_cast<uint8_t>(static_cast<uint16_t>(color.r) * brightness / 255),
    static_cast<uint8_t>(static_cast<uint16_t>(color.g) * brightness / 255),
    static_cast<uint8_t>(static_cast<uint16_t>(color.b) * brightness / 255),
    static_cast<uint8_t>(static_cast<uint16_t>(color.w) * brightness / 255),
  };
}

bool isBluePurpleFlowPreset(const RgbwColor &color) {
  return color.r == BLUE_PURPLE_FLOW_BASE.r &&
         color.g == BLUE_PURPLE_FLOW_BASE.g &&
         color.b == BLUE_PURPLE_FLOW_BASE.b &&
         color.w == BLUE_PURPLE_FLOW_BASE.w;
}

void setBluePurpleFlowTargets(uint8_t brightness) {
  const uint8_t phase = static_cast<uint8_t>((millis() / LIGHT_FLOW_STEP_MS) & 0xFF);
  const RgbwColor base = scaleColor(BLUE_PURPLE_FLOW_BASE, brightness);
  const RgbwColor blue = scaleColor(BLUE_PURPLE_FLOW_BLUE, brightness);

  light1Target = blendColor(base, blue, triangleWave(phase));
  light2Target = blendColor(base, blue, triangleWave(static_cast<uint8_t>(phase + LIGHT_FLOW_OFFSET)));
}

uint8_t manualFlowBrightness() {
  const uint8_t level = max4(manualLightColor.r, manualLightColor.g, manualLightColor.b, manualLightColor.w);
  return static_cast<uint8_t>(constrain(static_cast<int>(level), 32, 255));
}

RgbwColor manualAccentColor() {
  const uint8_t r = manualLightColor.r;
  const uint8_t g = manualLightColor.g;
  const uint8_t b = manualLightColor.b;

  if (r > 120 && b > 100 && g + 40 < max(r, b)) {
    return {
      static_cast<uint8_t>(constrain((static_cast<int>(r) + static_cast<int>(b)) / 2, 0, 255)),
      static_cast<uint8_t>(g / 3),
      255,
      manualLightColor.w,
    };
  }

  if (g > 100 && b > 100 && r < 120) {
    return {
      static_cast<uint8_t>(r / 3),
      static_cast<uint8_t>(constrain(static_cast<int>(g) + static_cast<int>(b) / 4, 0, 255)),
      static_cast<uint8_t>(constrain(static_cast<int>(b) + 32, 0, 255)),
      manualLightColor.w,
    };
  }

  if (b > r && b > g) {
    return {
      static_cast<uint8_t>(constrain(static_cast<int>(r) / 2 + static_cast<int>(b) / 4, 0, 255)),
      static_cast<uint8_t>(g / 2),
      255,
      manualLightColor.w,
    };
  }

  if (r > 150 && g > 80) {
    return {
      255,
      static_cast<uint8_t>(g / 2),
      static_cast<uint8_t>(constrain(static_cast<int>(b) + 96, 0, 255)),
      manualLightColor.w,
    };
  }

  return {
    static_cast<uint8_t>(b / 2),
    static_cast<uint8_t>(constrain(static_cast<int>(r) / 3 + static_cast<int>(g) / 2, 0, 255)),
    static_cast<uint8_t>(max(r, b)),
    manualLightColor.w,
  };
}

void setManualGradientTargets() {
  const uint8_t brightness = manualFlowBrightness();
  if (isBluePurpleFlowPreset(manualLightColor)) {
    setBluePurpleFlowTargets(brightness);
    return;
  }

  const uint8_t phase = static_cast<uint8_t>((millis() / LIGHT_FLOW_STEP_MS) & 0xFF);
  const RgbwColor base = scaleColor({manualLightColor.r, manualLightColor.g, manualLightColor.b, 0}, brightness);
  const RgbwColor accent = scaleColor(manualAccentColor(), brightness);
  const uint8_t glowBrightness = static_cast<uint8_t>(max(static_cast<int>(brightness) / 2, 32));
  const RgbwColor glow = scaleColor({
    static_cast<uint8_t>(constrain(static_cast<int>(manualLightColor.r) + 42, 0, 255)),
    static_cast<uint8_t>(constrain(static_cast<int>(manualLightColor.g) + 42, 0, 255)),
    static_cast<uint8_t>(constrain(static_cast<int>(manualLightColor.b) + 42, 0, 255)),
    manualLightColor.w,
  }, glowBrightness);

  light1Target = blendColor(base, accent, triangleWave(phase));
  light2Target = blendColor(accent, glow, triangleWave(static_cast<uint8_t>(phase + LIGHT_FLOW_OFFSET)));
}

void setLightColor(int startAddress, const RgbwColor &color) {
  dmxData[startAddress] = color.r;
  dmxData[startAddress + 1] = color.g;
  dmxData[startAddress + 2] = color.b;
  dmxData[startAddress + 3] = color.w;
}

void sendDmxFrame() {
  memset(dmxData, 0, DMX_PACKET_SIZE);
  setLightColor(DMX_LIGHT_1_ADDRESS, light1Current);
  setLightColor(DMX_LIGHT_2_ADDRESS, light2Current);
  lastDmxWriteSize = dmx_write(DMX_PORT, dmxData, DMX_PACKET_SIZE);
  lastDmxSendSize = dmx_send(DMX_PORT);
  dmxFrameCount++;
  if (lastDmxWriteSize != DMX_PACKET_SIZE || lastDmxSendSize == 0) {
    dmxSendFailCount++;
  }
  if (!dmx_wait_sent(DMX_PORT, DMX_TIMEOUT_TICK)) {
    dmxWaitFailCount++;
  }
}

