zzzz1121/A-dream/src/microduino_core_esp32_test/main.cpp
void setTwoLightsImmediate(const RgbwColor &light1, const RgbwColor &light2) {
  light1Current = softenSaturation(light1);
  light2Current = softenSaturation(light2);
  lightLevel = max(max4(light1Current.r, light1Current.g, light1Current.b, light1Current.w),
                   max4(light2Current.r, light2Current.g, light2Current.b, light2Current.w));
  sendDmxFrame();
}

void holdTwoLightsImmediate(const RgbwColor &light1, const RgbwColor &light2, uint16_t durationMs) {
  const uint32_t startMs = millis();
  while (millis() - startMs < durationMs) {
    setTwoLightsImmediate(light1, light2);
    delay(25);
  }
}

void runDmxBootSelfTest() {
#if DREAM_DMX_BOOT_SELF_TEST
  Serial.println("EVENT=DMX_SELF_TEST STEP=RED_BLUE");
  holdTwoLightsImmediate({255, 0, 0, 0}, {0, 0, 255, 0}, 1200);

  Serial.println("EVENT=DMX_SELF_TEST STEP=GREEN_PURPLE");
  holdTwoLightsImmediate({0, 255, 0, 0}, {120, 0, 255, 0}, 1200);

  Serial.println("EVENT=DMX_SELF_TEST STEP=WHITE_RED");
  holdTwoLightsImmediate({0, 0, 0, 255}, {255, 0, 0, 0}, 1200);

  Serial.println("EVENT=DMX_SELF_TEST STEP=OFF");
  holdTwoLightsImmediate({0, 0, 0, 0}, {0, 0, 0, 0}, 500);
  Serial.println("EVENT=DMX_SELF_TEST DONE");
#endif
}

void printMacAddress(const uint8_t *macAddress) {
  for (uint8_t i = 0; i < 6; i++) {
    if (macAddress[i] < 0x10) {
      Serial.print("0");
    }
    Serial.print(macAddress[i], HEX);
    if (i < 5) {
      Serial.print(":");
    }
  }
}

bool validateEegPacket(DreamEegEspNowPacket &packet) {
  if (packet.magic != DREAM_PACKET_MAGIC ||
      packet.version != DREAM_PROTOCOL_VERSION ||
      packet.type != DREAM_PACKET_EEG) {
    return false;
  }

  const uint16_t expectedChecksum = calculatePacketChecksum(packet);
  if (packet.checksum != expectedChecksum) {
    eegChecksumErrorCount++;
    return false;
  }

  packet.poorSignal = static_cast<uint8_t>(constrain(static_cast<int>(packet.poorSignal), 0, 255));
  packet.attention = static_cast<uint8_t>(constrain(static_cast<int>(packet.attention), 0, 100));
  packet.meditation = static_cast<uint8_t>(constrain(static_cast<int>(packet.meditation), 0, 100));
  return true;
}

bool validateControlPacket(DreamControlEspNowPacket &packet) {
  if (packet.magic != DREAM_PACKET_MAGIC ||
      packet.version != DREAM_PROTOCOL_VERSION ||
      packet.type != DREAM_PACKET_CONTROL) {
    return false;
  }

  const uint16_t expectedChecksum = calculatePacketChecksum(packet);
  if (packet.checksum != expectedChecksum) {
    controlChecksumErrorCount++;
    return false;
  }

  return packet.action > CONTROL_NONE && packet.action <= CONTROL_BUBBLE_CONFIG;
}

void updateSequenceCounters(uint32_t incomingSeq) {
  if (!haveEeg) {
    return;
  }

  const uint32_t lastSeq = latestEegPacket.seq;
  if (incomingSeq > lastSeq + 1) {
    eegDropCount += incomingSeq - lastSeq - 1;
  } else if (incomingSeq <= lastSeq) {
    eegDropCount++;
  }
}

void handleEegPacket(const DreamEegEspNowPacket &packet, const uint8_t *macAddress) {
  updateSequenceCounters(packet.seq);
  latestEegPacket = packet;
  lastEegFrameMs = millis();
  eegRxCount++;
  haveEeg = true;

  Serial.print("EVENT=ESPNOW_EEG_RX SEQ=");
  Serial.print(latestEegPacket.seq);
  Serial.print(" POOR_SIGNAL=");
  Serial.print(latestEegPacket.poorSignal);
  Serial.print(" ATTENTION=");
  Serial.print(latestEegPacket.attention);
  Serial.print(" MEDITATION=");
  Serial.print(latestEegPacket.meditation);
  Serial.print(" SRC=");
  if (macAddress != nullptr) {
    printMacAddress(macAddress);
  } else {
    Serial.print("UNKNOWN");
  }
  Serial.println();
}

uint8_t clampByteArg(uint16_t value) {
  return static_cast<uint8_t>(constrain(static_cast<int>(value), 0, 255));
}

#if DREAM_ENABLE_STEPPER_OUTPUT
uint16_t requestedStepperSteps(uint16_t value) {
  const uint16_t requested = value == 0 ? STEPPER_STEPS_PER_REV : value;
  return static_cast<uint16_t>(constrain(static_cast<int>(requested), 1, STEPPER_MAX_COMMAND_STEPS));
}

uint8_t requestedStepperTargetMask(uint16_t value) {
  (void)value;
  return STEPPER_TARGET_SINGLE;
}

int32_t clampStepperTarget(int32_t target) {
  return constrain(target, static_cast<int32_t>(STEPPER_MIN_POSITION_STEPS), static_cast<int32_t>(STEPPER_MAX_POSITION_STEPS));
}
#endif

bool bubbleFlowActive() {
  return bubbleState != BUBBLE_IDLE;
}

uint32_t currentBubbleActiveMs() {
  return bubbleFlowActive() ? millis() - bubbleStartMs : 0;
}

void setBubbleState(uint8_t nextState, uint32_t now, const char *label) {
  if (bubbleState == nextState) {
    return;
  }

  bubbleState = nextState;
  bubbleStateStartMs = now;
  Serial.print("EVENT=BUBBLE_STEP STATE=");
  Serial.println(label);
}

void resetBubbleTimelineMarkers() {
  bubbleFogStartMs = 0;
  bubbleFanStartMs = 0;
  bubbleForwardStartMs = 0;
  bubbleForwardDoneMs = 0;
  bubbleFogStopMs = 0;
  bubbleReverseDoneMs = 0;
}

#if DREAM_ENABLE_STEPPER_OUTPUT
uint16_t requestedBubbleSteps(uint16_t value) {
  return static_cast<uint16_t>(constrain(static_cast<int>(value), 0, STEPPER_MAX_COMMAND_STEPS));
}
#else
uint16_t requestedBubbleSteps(uint16_t value) {
  return value;
}
#endif

uint16_t requestedBubbleTimelineMs(uint16_t value) {
  const uint32_t constrained = constrain(static_cast<uint32_t>(value), static_cast<uint32_t>(0), static_cast<uint32_t>(60000));
  return static_cast<uint16_t>(((constrained + 50) / 100) * 100);
}

void applyBubbleConfig(const DreamControlEspNowPacket &packet) {
  if (bubbleFlowActive()) {
    Serial.println("EVENT=BUBBLE_CONFIG_IGNORED REASON=BUSY");
    return;
  }

  bubbleConfig.reverseSteps = requestedBubbleSteps(packet.arg1);
  bubbleConfig.fogStartAtMs = requestedBubbleTimelineMs(packet.arg2);
  bubbleConfig.fanLightStartAtMs = requestedBubbleTimelineMs(packet.arg3);
  bubbleConfig.forwardStartAtMs = requestedBubbleTimelineMs(packet.arg4);
  bubbleConfig.forwardSteps = requestedBubbleSteps(packet.arg5);
  bubbleConfig.fogStopAtMs = requestedBubbleTimelineMs(packet.arg6);
  bubbleConfig.fanStopAtMs = requestedBubbleTimelineMs(packet.arg7);
  bubbleConfig.lightStopAtMs = requestedBubbleTimelineMs(packet.arg8);

  Serial.print("EVENT=BUBBLE_CONFIG_APPLIED REVERSE_STEPS=");
  Serial.print(bubbleConfig.reverseSteps);
  Serial.print(" FOG_START_AT_MS=");
  Serial.print(bubbleConfig.fogStartAtMs);
  Serial.print(" FAN_LIGHT_START_AT_MS=");
  Serial.print(bubbleConfig.fanLightStartAtMs);
  Serial.print(" FORWARD_START_AT_MS=");
  Serial.print(bubbleConfig.forwardStartAtMs);
  Serial.print(" FORWARD_STEPS=");
  Serial.print(bubbleConfig.forwardSteps);
  Serial.print(" FOG_STOP_AT_MS=");
  Serial.print(bubbleConfig.fogStopAtMs);
  Serial.print(" FAN_STOP_AT_MS=");
  Serial.print(bubbleConfig.fanStopAtMs);
  Serial.print(" LIGHT_STOP_AT_MS=");
  Serial.println(bubbleConfig.lightStopAtMs);
}

bool startBubbleStepperMove(uint16_t steps, bool forward, uint8_t phase) {
#if DREAM_ENABLE_STEPPER_OUTPUT
  stepperPulseActive = false;
  digitalWrite(STEPPER_STEP_PIN, HIGH);
  if (steps == 0) {
    bubbleStepperMoving = false;
    bubbleStepperPhase = BUBBLE_STEPPER_NONE;
    bubbleStepperTargetSteps = stepperPositionSteps;
    stepperTargetSteps = stepperPositionSteps;
    return false;
  }

