zzzz1121/A-dream/src/microduino_core_esp32_test/main.cpp
  const int32_t signedSteps = static_cast<int32_t>(steps);
  bubbleStepperTargetSteps = clampStepperTarget(stepperPositionSteps + (forward ? signedSteps : -signedSteps));
  if (bubbleStepperTargetSteps == stepperPositionSteps) {
    bubbleStepperMoving = false;
    bubbleStepperPhase = BUBBLE_STEPPER_NONE;
    stepperTargetSteps = stepperPositionSteps;
    return false;
  }

  bubbleStepperMoving = true;
  bubbleStepperPhase = phase;
  return true;
#else
  (void)steps;
  (void)forward;
  (void)phase;
  bubbleStepperMoving = false;
  bubbleStepperPhase = BUBBLE_STEPPER_NONE;
  return false;
#endif
}

void abortBubbleFlow(const char *reason) {
  if (!bubbleFlowActive()) {
    return;
  }

  bubbleState = BUBBLE_IDLE;
  bubbleStateStartMs = millis();
  resetBubbleTimelineMarkers();
  bubbleStepperMoving = false;
  bubbleStepperPhase = BUBBLE_STEPPER_NONE;
#if DREAM_ENABLE_STEPPER_OUTPUT
  stepperTargetSteps = stepperPositionSteps;
  bubbleStepperTargetSteps = stepperPositionSteps;
  stepperPulseActive = false;
  digitalWrite(STEPPER_STEP_PIN, HIGH);
#endif
  Serial.print("EVENT=BUBBLE_ABORTED REASON=");
  Serial.println(reason);
}

void startBubbleForwardReset(uint32_t now) {
  if (bubbleForwardStartMs != 0) {
    return;
  }

  bubbleForwardStartMs = now;
  const bool moving = startBubbleStepperMove(bubbleConfig.forwardSteps, true, BUBBLE_STEPPER_FORWARD);
  if (!moving) {
    bubbleForwardDoneMs = now;
  }
  setBubbleState(BUBBLE_FORWARD_RESET, now, "FORWARD_RESET");
}

void startBubbleFlow(const char *source) {
  if (!systemEnabled) {
    Serial.print("EVENT=BUBBLE_TRIGGER_IGNORED REASON=SYSTEM_OFF SOURCE=");
    Serial.println(source);
    return;
  }
  if (bubbleFlowActive()) {
    Serial.print("EVENT=BUBBLE_TRIGGER_IGNORED REASON=BUSY SOURCE=");
    Serial.println(source);
    return;
  }

  const uint32_t now = millis();
  bubbleState = BUBBLE_REVERSE_PULL;
  bubbleStateStartMs = now;
  bubbleStartMs = now;
  resetBubbleTimelineMarkers();
  bubbleTriggerCount++;
  autoLightReleased = false;
  bubbleStepperMoving = false;
  bubbleStepperPhase = BUBBLE_STEPPER_NONE;
#if DREAM_ENABLE_STEPPER_OUTPUT
  manualStepperActive = false;
  manualStepperMask = 0;
#endif
  if (!startBubbleStepperMove(bubbleConfig.reverseSteps, false, BUBBLE_STEPPER_REVERSE)) {
    bubbleReverseDoneMs = now;
  }

  Serial.print("EVENT=BUBBLE_TRIGGERED SOURCE=");
  Serial.print(source);
  Serial.print(" COUNT=");
  Serial.print(bubbleTriggerCount);
  Serial.print(" REVERSE_STEPS=");
  Serial.print(bubbleConfig.reverseSteps);
  Serial.print(" FOG_START_AT_MS=");
  Serial.print(bubbleConfig.fogStartAtMs);
  Serial.print(" FAN_LIGHT_START_AT_MS=");
  Serial.print(bubbleConfig.fanLightStartAtMs);
  Serial.print(" FORWARD_START_AT_MS=");
  Serial.print(bubbleConfig.forwardStartAtMs);
  Serial.print(" FORWARD_STEPS=");
  Serial.print(bubbleConfig.forwardSteps);
  Serial.print(" FOG_STOP_AT_MS=");
  Serial.print(bubbleConfig.fogStopAtMs);
  Serial.print(" FAN_STOP_AT_MS=");
  Serial.print(bubbleConfig.fanStopAtMs);
  Serial.print(" LIGHT_STOP_AT_MS=");
  Serial.println(bubbleConfig.lightStopAtMs);
}

bool bubbleTimelineOutputActive(uint32_t now, uint16_t startAtMs, uint16_t stopAtMs) {
  if (!bubbleFlowActive()) {
    return false;
  }
  const uint32_t activeMs = now - bubbleStartMs;
  return activeMs >= startAtMs && activeMs < stopAtMs;
}

bool bubbleFogOutputActive(uint32_t now) {
  return bubbleTimelineOutputActive(now, bubbleConfig.fogStartAtMs, bubbleConfig.fogStopAtMs);
}

bool bubbleFanOutputActive(uint32_t now) {
  return bubbleTimelineOutputActive(now, bubbleConfig.fanLightStartAtMs, bubbleConfig.fanStopAtMs);
}

bool bubbleLightOutputActive(uint32_t now) {
  return bubbleTimelineOutputActive(now, bubbleConfig.fanLightStartAtMs, bubbleConfig.lightStopAtMs);
}

void updateBubbleTimeline() {
  if (!bubbleFlowActive()) {
    return;
  }

  const uint32_t now = millis();
  const uint32_t activeMs = now - bubbleStartMs;

  if (bubbleFogStartMs == 0 && activeMs >= bubbleConfig.fogStartAtMs) {
    bubbleFogStartMs = now;
    setBubbleState(BUBBLE_FOG_ON, now, "FOG_ON");
  }

  if (bubbleFanStartMs == 0 && activeMs >= bubbleConfig.fanLightStartAtMs) {
    bubbleFanStartMs = now;
    setBubbleState(BUBBLE_BLOW_OUT, now, "FAN_LIGHT_ON");
  }

  if (bubbleForwardStartMs == 0 &&
      activeMs >= bubbleConfig.forwardStartAtMs &&
      !bubbleStepperMoving) {
    startBubbleForwardReset(now);
  }

  if (bubbleFogStopMs == 0 && activeMs >= bubbleConfig.fogStopAtMs) {
    bubbleFogStopMs = now;
    setBubbleState(BUBBLE_WIND_DOWN, now, "FOG_OFF");
  }

  if (bubbleForwardDoneMs != 0) {
    if (bubbleState == BUBBLE_FORWARD_RESET) {
      setBubbleState(BUBBLE_FOG_HOLD, now, "FOG_HOLD");
    }
  }

  const bool fogDone = activeMs >= bubbleConfig.fogStopAtMs;
  const bool fanDone = activeMs >= bubbleConfig.fanStopAtMs;
  const bool lightDone = activeMs >= bubbleConfig.lightStopAtMs;

  if (fanDone && !lightDone) {
    setBubbleState(BUBBLE_LIGHT_HOLD, now, "LIGHT_HOLD");
  }

  if (bubbleForwardStartMs != 0 && fogDone && fanDone && lightDone && !bubbleStepperMoving) {
    bubbleState = BUBBLE_IDLE;
    bubbleStateStartMs = now;
    bubbleStepperMoving = false;
    bubbleStepperPhase = BUBBLE_STEPPER_NONE;
    autoLightReleased = true;
    Serial.print("EVENT=BUBBLE_DONE ACTIVE_MS=");
    Serial.println(now - bubbleStartMs);
  }
}

bool isDuplicateControlPacket(const DreamControlEspNowPacket &packet) {
  return haveAppliedControlPacket &&
         packet.seq == lastAppliedControlSeq &&
         packet.pcTimeMs == lastAppliedControlPcTimeMs &&
         packet.action == lastAppliedControlActionForDedup;
}

void rememberControlPacket(const DreamControlEspNowPacket &packet) {
  haveAppliedControlPacket = true;
  lastAppliedControlSeq = packet.seq;
  lastAppliedControlPcTimeMs = packet.pcTimeMs;
  lastAppliedControlActionForDedup = packet.action;
}

void applyControlPacket(const DreamControlEspNowPacket &packet, const uint8_t *macAddress) {
  if (isDuplicateControlPacket(packet)) {
    Serial.print("EVENT=CONTROL_DUPLICATE SEQ=");
    Serial.print(packet.seq);
    Serial.print(" ACTION=");
    Serial.println(packet.action);
    return;
  }

  rememberControlPacket(packet);
  controlRxCount++;
  lastControlAction = packet.action;

  Serial.print("EVENT=CONTROL_RX SEQ=");
  Serial.print(packet.seq);
  Serial.print(" ACTION=");
  Serial.print(packet.action);
  Serial.print(" ARG1=");
  Serial.print(packet.arg1);
  Serial.print(" ARG2=");
  Serial.print(packet.arg2);
  Serial.print(" ARG3=");
  Serial.print(packet.arg3);
  Serial.print(" ARG4=");
  Serial.print(packet.arg4);
  Serial.print(" ARG5=");
  Serial.print(packet.arg5);
  Serial.print(" ARG6=");
  Serial.print(packet.arg6);
  Serial.print(" ARG7=");
  Serial.print(packet.arg7);
  Serial.print(" ARG8=");
  Serial.print(packet.arg8);
  Serial.print(" SRC=");
  if (macAddress != nullptr) {
    printMacAddress(macAddress);
  } else {
    Serial.print("UNKNOWN");
  }
  Serial.println();

  switch (packet.action) {
    case CONTROL_SYSTEM_ENABLE:
      systemEnabled = true;
      manualLightEnabled = false;
      manualLightColor = {0, 0, 0, 0};
      autoLightReleased = false;
#if DREAM_ENABLE_RELAY_OUTPUT
      manualFogRequested = false;
      manualFanRequested = false;
#endif
#if DREAM_ENABLE_STEPPER_OUTPUT
      manualStepperActive = false;
      manualStepperMask = 0;
      if (!bubbleFlowActive()) {
        stepperTargetSteps = stepperPositionSteps;
        stepperPulseActive = false;
        digitalWrite(STEPPER_STEP_PIN, HIGH);
      }
#endif
      break;
    case CONTROL_SYSTEM_DISABLE:
      systemEnabled = false;
      abortBubbleFlow("SYSTEM_DISABLE");
      manualLightEnabled = false;
      manualLightColor = {0, 0, 0, 0};
      autoLightReleased = false;
#if DREAM_ENABLE_RELAY_OUTPUT
      manualFogRequested = false;
      manualFanRequested = false;
#endif
#if DREAM_ENABLE_STEPPER_OUTPUT
      manualStepperActive = false;
      manualStepperMask = 0;
      if (!bubbleFlowActive()) {
        stepperTargetSteps = stepperPositionSteps;
        stepperPulseActive = false;
        digitalWrite(STEPPER_STEP_PIN, HIGH);
      }
#endif
      break;
    case CONTROL_LIGHT_AUTO:
      manualLightEnabled = false;
      break;
    case CONTROL_LIGHT_COLOR:
      if (!systemEnabled) {
        Serial.println("EVENT=CONTROL_IGNORED SYSTEM=OFF ACTION=LIGHT_COLOR");
        break;
      }
      manualLightEnabled = true;
      manualLightColor = {
        clampByteArg(packet.arg1),
        clampByteArg(packet.arg2),
        clampByteArg(packet.arg3),
        clampByteArg(packet.arg4),
      };
      break;
    case CONTROL_LIGHT_OFF:
      manualLightEnabled = true;
      manualLightColor = {0, 0, 0, 0};
      break;
    case CONTROL_RELAY_ON:
      if (!systemEnabled) {
        Serial.println("EVENT=CONTROL_IGNORED SYSTEM=OFF ACTION=RELAY_ON");
        break;
      }
#if DREAM_ENABLE_RELAY_OUTPUT
      manualFogRequested = true;
#endif
      break;
    case CONTROL_RELAY_OFF:
#if DREAM_ENABLE_RELAY_OUTPUT
      manualFogRequested = false;
#endif
      break;
    case CONTROL_FAN_ON:
      if (!systemEnabled) {
        Serial.println("EVENT=CONTROL_IGNORED SYSTEM=OFF ACTION=FAN_ON");
        break;
      }
#if DREAM_ENABLE_RELAY_OUTPUT
      manualFanRequested = true;
#endif
      break;
    case CONTROL_FAN_OFF:
#if DREAM_ENABLE_RELAY_OUTPUT
      manualFanRequested = false;
#endif
      break;
    case CONTROL_BUBBLE_TRIGGER:
      startBubbleFlow("CONTROL");
      break;
    case CONTROL_BUBBLE_CONFIG:
      applyBubbleConfig(packet);
      break;
    case CONTROL_STEPPER_FORWARD:
#if DREAM_ENABLE_STEPPER_OUTPUT
    {
      if (!systemEnabled) {
        Serial.println("EVENT=CONTROL_IGNORED SYSTEM=OFF ACTION=STEPPER_FORWARD");
        break;
      }
      if (bubbleFlowActive()) {
        Serial.println("EVENT=CONTROL_IGNORED BUBBLE=BUSY ACTION=STEPPER_FORWARD");
        break;
      }
      const uint8_t targetMask = requestedStepperTargetMask(packet.arg2);
      const uint8_t startMask = targetMask & ~manualStepperMask;
      const int32_t steps = static_cast<int32_t>(requestedStepperSteps(packet.arg1));
      if (startMask != targetMask) {
        Serial.print("EVENT=STEPPER_BUSY_IGNORED ACTION=FORWARD MASK=");
        Serial.println(targetMask & manualStepperMask);
      }
      if (startMask == 0) {
        break;
      }
      manualStepperActive = true;
      manualStepperMask |= startMask;
      manualStepperTargetSteps = clampStepperTarget(stepperPositionSteps + steps);
    }
#endif
      break;
    case CONTROL_STEPPER_BACKWARD:
#if DREAM_ENABLE_STEPPER_OUTPUT
    {
      if (!systemEnabled) {
        Serial.println("EVENT=CONTROL_IGNORED SYSTEM=OFF ACTION=STEPPER_BACKWARD");
        break;
      }
      if (bubbleFlowActive()) {
        Serial.println("EVENT=CONTROL_IGNORED BUBBLE=BUSY ACTION=STEPPER_BACKWARD");
        break;
      }
      const uint8_t targetMask = requestedStepperTargetMask(packet.arg2);
      const uint8_t startMask = targetMask & ~manualStepperMask;
      const int32_t steps = static_cast<int32_t>(requestedStepperSteps(packet.arg1));
      if (startMask != targetMask) {
        Serial.print("EVENT=STEPPER_BUSY_IGNORED ACTION=BACKWARD MASK=");
        Serial.println(targetMask & manualStepperMask);
      }
      if (startMask == 0) {
        break;
      }
      manualStepperActive = true;
      manualStepperMask |= startMask;
      manualStepperTargetSteps = clampStepperTarget(stepperPositionSteps - steps);
    }
#endif
      break;
    case CONTROL_STEPPER_STOP:
#if DREAM_ENABLE_STEPPER_OUTPUT
    {
      if (bubbleFlowActive()) {
        Serial.println("EVENT=CONTROL_IGNORED BUBBLE=BUSY ACTION=STEPPER_STOP");
        break;
      }
      const uint8_t targetMask = requestedStepperTargetMask(packet.arg2);
      manualStepperMask &= ~targetMask;
      manualStepperActive = manualStepperMask != 0;
      stepperTargetSteps = stepperPositionSteps;
      manualStepperTargetSteps = stepperPositionSteps;
      stepperPulseActive = false;
      digitalWrite(STEPPER_STEP_PIN, HIGH);
    }
#endif
      break;
    case CONTROL_ALL_STOP:
      systemEnabled = false;
      abortBubbleFlow("ALL_STOP");
      manualLightEnabled = false;
      manualLightColor = {0, 0, 0, 0};
      autoLightReleased = false;
#if DREAM_ENABLE_RELAY_OUTPUT
      manualFogRequested = false;
      manualFanRequested = false;
#endif
#if DREAM_ENABLE_STEPPER_OUTPUT
      manualStepperActive = false;
      manualStepperMask = 0;
      if (!bubbleFlowActive()) {
        stepperTargetSteps = stepperPositionSteps;
        stepperPulseActive = false;
        digitalWrite(STEPPER_STEP_PIN, HIGH);
      }
#endif
      break;
    default:
      break;
  }
}

void handleEspNowReceive(const uint8_t *macAddress, const uint8_t *data, int dataLength) {
  if (dataLength == static_cast<int>(sizeof(DreamEegEspNowPacket))) {
    DreamEegEspNowPacket packet = {};
    memcpy(&packet, data, sizeof(packet));
    if (!validateEegPacket(packet)) {
      eegDropCount++;
      return;
    }

    handleEegPacket(packet, macAddress);
    return;
  }

  if (dataLength == static_cast<int>(sizeof(DreamControlEspNowPacket))) {
    DreamControlEspNowPacket packet = {};
    memcpy(&packet, data, sizeof(packet));
    if (validateControlPacket(packet)) {
      applyControlPacket(packet, macAddress);
    }
    return;
  }
}

#if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
void onEspNowReceive(const esp_now_recv_info_t *recvInfo, const uint8_t *data, int dataLength) {
  const uint8_t *macAddress = recvInfo == nullptr ? nullptr : recvInfo->src_addr;
  handleEspNowReceive(macAddress, data, dataLength);
}
#else
void onEspNowReceive(const uint8_t *macAddress, const uint8_t *data, int dataLength) {
  handleEspNowReceive(macAddress, data, dataLength);
}
#endif

