zzzz1121/A-dream/src/microduino_core_esp32_test/main.cpp
void initEspNow() {
  WiFi.mode(WIFI_STA);
  WiFi.disconnect();
  esp_wifi_set_ps(WIFI_PS_NONE);
  esp_wifi_set_channel(ESPNOW_CHANNEL, WIFI_SECOND_CHAN_NONE);

  Serial.print("EVENT=WIFI_STA_READY MAC=");
  Serial.println(WiFi.macAddress());
  Serial.print("EVENT=ESPNOW_CHANNEL VALUE=");
  Serial.println(ESPNOW_CHANNEL);

  const esp_err_t initResult = esp_now_init();
  if (initResult != ESP_OK) {
    Serial.print("EVENT=ESPNOW_INIT_FAIL ERR=");
    Serial.println(initResult);
    espNowReady = false;
    return;
  }

  esp_now_register_recv_cb(onEspNowReceive);

  esp_now_peer_info_t peerInfo = {};
  memcpy(peerInfo.peer_addr, BROADCAST_MAC, sizeof(BROADCAST_MAC));
  peerInfo.channel = ESPNOW_CHANNEL;
  peerInfo.ifidx = WIFI_IF_STA;
  peerInfo.encrypt = false;

  const esp_err_t peerResult = esp_now_add_peer(&peerInfo);
  if (peerResult != ESP_OK && peerResult != ESP_ERR_ESPNOW_EXIST) {
    Serial.print("EVENT=ESPNOW_ADD_PEER_FAIL ERR=");
    Serial.println(peerResult);
    espNowReady = false;
    return;
  }

  espNowReady = true;
  Serial.println("EVENT=ESPNOW_READY MODE=BROADCAST");
}

void initDmx() {
  dmx_config_t config = DMX_CONFIG_DEFAULT;
  dmx_personality_t personalities[] = {
    {1, "Two RGBW Lights"}
  };

  const bool driverInstalled = dmx_driver_install(DMX_PORT, &config, personalities, 1);
  const bool pinConfigured = dmx_set_pin(DMX_PORT, DMX_TX_PIN, DMX_RX_PIN, DMX_EN_PIN);
  sendDmxFrame();

  Serial.print("EVENT=DMX_READY TX_PIN=");
  Serial.print(DMX_TX_PIN);
  Serial.print(" LIGHT1=");
  Serial.print(DMX_LIGHT_1_ADDRESS);
  Serial.print(" LIGHT2=");
  Serial.print(DMX_LIGHT_2_ADDRESS);
  Serial.print(" DRIVER=");
  Serial.print(driverInstalled ? "OK" : "FAIL");
  Serial.print(" PIN=");
  Serial.println(pinConfigured ? "OK" : "FAIL");
  runDmxBootSelfTest();
}

void initStepper() {
#if DREAM_ENABLE_STEPPER_OUTPUT
  pinMode(STEPPER_STEP_PIN, OUTPUT);
  pinMode(STEPPER_DIR_PIN, OUTPUT);
  digitalWrite(STEPPER_STEP_PIN, HIGH);
  digitalWrite(STEPPER_DIR_PIN, STEPPER_DIR_INVERT ? LOW : HIGH);
  if (STEPPER_ENABLE_PIN >= 0) {
    pinMode(STEPPER_ENABLE_PIN, OUTPUT);
    digitalWrite(STEPPER_ENABLE_PIN, STEPPER_ENABLE_ACTIVE_LEVEL);
  }
  stepperState = STEPPER_IDLE;
  Serial.print("EVENT=STEPPER_READY MODE=SINGLE_DRIVER STEP=");
  Serial.print(STEPPER_STEP_PIN);
  Serial.print(" DIR=");
  Serial.print(STEPPER_DIR_PIN);
  Serial.print(" STEPS_PER_REV=");
  Serial.println(STEPPER_STEPS_PER_REV);
#else
  stepperState = STEPPER_DISABLED;
  Serial.println("EVENT=STEPPER_READY MODE=DISABLED");
#endif
}

void initRelay() {
#if DREAM_ENABLE_RELAY_OUTPUT
  pinMode(FOG_RELAY_PIN, OUTPUT);
  pinMode(FAN_RELAY_PIN, OUTPUT);
  digitalWrite(FOG_RELAY_PIN, !RELAY_ACTIVE_LEVEL);
  digitalWrite(FAN_RELAY_PIN, !RELAY_ACTIVE_LEVEL);
  relayState = RELAY_OFF;
  fanState = RELAY_OFF;
  Serial.print("EVENT=RELAY_READY MODE=BUBBLE_OUTPUT FOG_PIN=");
  Serial.print(FOG_RELAY_PIN);
  Serial.print(" FAN_PIN=");
  Serial.print(FAN_RELAY_PIN);
  Serial.print(" ACTIVE_LEVEL=");
  Serial.println(RELAY_ACTIVE_LEVEL == HIGH ? "HIGH" : "LOW");
#else
  relayState = RELAY_OFF;
  fanState = RELAY_OFF;
  Serial.println("EVENT=RELAY_READY MODE=DISABLED");
#endif
}

uint32_t eegAgeMs() {
  if (!haveEeg) {
    return 0xFFFFFFFFUL;
  }
  return millis() - lastEegFrameMs;
}

void updateSafetyState() {
  const bool timedOut = !haveEeg || eegAgeMs() > EEG_TIMEOUT_MS;
  if (timedOut) {
    safetyState = SAFETY_LINK_TIMEOUT;
    if (!timeoutWasActive) {
      eegTimeoutCount++;
      timeoutWasActive = true;
      Serial.println("EVENT=EEG_TIMEOUT ACTION=SAFE_STATE");
    }
    return;
  }

  timeoutWasActive = false;
  safetyState = isEegSignalBad(latestEegPacket.poorSignal) ? SAFETY_SIGNAL_BAD : SAFETY_NORMAL;
}

void updateLightTargets() {
  if (!systemEnabled) {
    manualLightEnabled = false;
    manualLightColor = {0, 0, 0, 0};
    lightMode = LIGHT_OFF;
    light1Target = {0, 0, 0, 0};
    light2Target = {0, 0, 0, 0};
    return;
  }

  if (manualLightEnabled && isColorOff(manualLightColor)) {
    lightMode = LIGHT_OFF;
    light1Target = {0, 0, 0, 0};
    light2Target = {0, 0, 0, 0};
    return;
  }

  if (bubbleFlowActive()) {
    const uint32_t now = millis();
    if (!bubbleLightOutputActive(now)) {
      lightMode = LIGHT_OFF;
      light1Target = {0, 0, 0, 0};
      light2Target = {0, 0, 0, 0};
      return;
    }

    if (isColorOff(manualLightColor)) {
      lightMode = LIGHT_IDLE;
      setBluePurpleFlowTargets(255);
    } else {
      lightMode = LIGHT_MANUAL;
      setManualGradientTargets();
    }
    return;
  }

  if (manualLightEnabled) {
    lightMode = LIGHT_MANUAL;
    if (isColorOff(manualLightColor)) {
      light1Target = {0, 0, 0, 0};
      light2Target = {0, 0, 0, 0};
    } else {
      setManualGradientTargets();
    }
    return;
  }

  if (!autoLightReleased) {
    lightMode = LIGHT_OFF;
    light1Target = {0, 0, 0, 0};
    light2Target = {0, 0, 0, 0};
    return;
  }

  if (safetyState == SAFETY_LINK_TIMEOUT) {
    lightMode = LIGHT_IDLE;
    setBluePurpleFlowTargets(255);
    return;
  }

  if (safetyState == SAFETY_SIGNAL_BAD) {
    lightMode = LIGHT_SIGNAL_BAD;
    light1Target = {0, 0, 0, 0};
    light2Target = {0, 0, 0, 0};
    return;
  }

  const uint8_t attention = scalePercentToByte(latestEegPacket.attention);
  const uint8_t meditation = scalePercentToByte(latestEegPacket.meditation);
  const uint8_t flowBrightness = static_cast<uint8_t>(constrain(static_cast<int>(max(attention, meditation)), 64, 255));

  lightMode = LIGHT_EEG_BLEND;
  setFlowTargets(flowBrightness, latestEegPacket.attention);
}

void updateLightController() {
  updateLightTargets();
  light1Target = softenSaturation(light1Target);
  light2Target = softenSaturation(light2Target);

  const uint32_t now = millis();
  if (now - lastDmxRefreshMs < DMX_REFRESH_MS) {
    return;
  }

  lastDmxRefreshMs = now;
  const bool forceImmediateLight = !systemEnabled ||
                                   lightMode == LIGHT_SIGNAL_BAD ||
                                   lightMode == LIGHT_TIMEOUT ||
                                   (isColorOff(light1Target) && isColorOff(light2Target));
  if (forceImmediateLight) {
    light1Current = light1Target;
    light2Current = light2Target;
  } else {
    light1Current = smoothColor(light1Current, light1Target);
    light2Current = smoothColor(light2Current, light2Target);
  }
  lightLevel = max(max4(light1Current.r, light1Current.g, light1Current.b, light1Current.w),
                   max4(light2Current.r, light2Current.g, light2Current.b, light2Current.w));
  sendDmxFrame();
}

#if DREAM_ENABLE_STEPPER_OUTPUT
void writeStepperStepPin(uint8_t targetMask, uint8_t level) {
  (void)targetMask;
  digitalWrite(STEPPER_STEP_PIN, level);
}

