zzzz1121/A-dream/src/microduino_core_esp32_test/main.cpp
void writeStepperDirectionPin(uint8_t targetMask, bool forward) {
  (void)targetMask;
  const bool outputForward = STEPPER_DIR_INVERT ? !forward : forward;
  digitalWrite(STEPPER_DIR_PIN, outputForward ? HIGH : LOW);
}

bool updateSingleStepper(uint8_t targetMask,
                         int32_t &positionSteps,
                         int32_t targetSteps,
                         uint32_t &lastPulseUs,
                         bool &pulseActive,
                         uint32_t nowUs) {
  if (targetSteps == positionSteps) {
    pulseActive = false;
    writeStepperStepPin(targetMask, HIGH);
    return false;
  }

  const int8_t direction = targetSteps > positionSteps ? 1 : -1;
  writeStepperDirectionPin(targetMask, direction > 0);

  if (static_cast<uint32_t>(nowUs - lastPulseUs) < STEPPER_PULSE_HALF_PERIOD_US) {
    return true;
  }

  lastPulseUs = nowUs;
  if (pulseActive) {
    writeStepperStepPin(targetMask, HIGH);
    pulseActive = false;
    positionSteps += direction;
  } else {
    writeStepperStepPin(targetMask, LOW);
    pulseActive = true;
  }
  return true;
}

bool stepperTargetsReached() {
  return stepperTargetSteps == stepperPositionSteps && !stepperPulseActive;
}
#endif

void updateStepperController() {
#if DREAM_ENABLE_STEPPER_OUTPUT
  const bool bubbleActive = bubbleFlowActive();
  if (!systemEnabled && !bubbleActive) {
    manualStepperActive = false;
    manualStepperMask = 0;
    stepperTargetSteps = stepperPositionSteps;
    stepperPulseActive = false;
    writeStepperStepPin(STEPPER_TARGET_SINGLE, HIGH);
    if (STEPPER_ENABLE_PIN >= 0) {
      digitalWrite(STEPPER_ENABLE_PIN, !STEPPER_ENABLE_ACTIVE_LEVEL);
    }
    stepperState = STEPPER_DISABLED;
    return;
  }

  if (bubbleActive) {
    if (STEPPER_ENABLE_PIN >= 0) {
      digitalWrite(STEPPER_ENABLE_PIN, STEPPER_ENABLE_ACTIVE_LEVEL);
    }

    if (!bubbleStepperMoving) {
      stepperTargetSteps = stepperPositionSteps;
      stepperPulseActive = false;
      writeStepperStepPin(STEPPER_TARGET_SINGLE, HIGH);
      stepperState = STEPPER_IDLE;
      return;
    }

    stepperState = STEPPER_MOVING;
    stepperTargetSteps = bubbleStepperTargetSteps;
    const uint32_t nowUs = micros();
    const bool moving = updateSingleStepper(STEPPER_TARGET_SINGLE,
                                            stepperPositionSteps,
                                            stepperTargetSteps,
                                            lastStepperPulseUs,
                                            stepperPulseActive,
                                            nowUs);
    if (!moving) {
      const uint32_t now = millis();
      if (bubbleStepperPhase == BUBBLE_STEPPER_REVERSE && bubbleReverseDoneMs == 0) {
        bubbleReverseDoneMs = now;
        Serial.println("EVENT=BUBBLE_STEPPER_DONE PHASE=REVERSE");
      } else if (bubbleStepperPhase == BUBBLE_STEPPER_FORWARD && bubbleForwardDoneMs == 0) {
        bubbleForwardDoneMs = now;
        Serial.println("EVENT=BUBBLE_STEPPER_DONE PHASE=FORWARD");
      }
      bubbleStepperMoving = false;
      bubbleStepperPhase = BUBBLE_STEPPER_NONE;
      stepperState = STEPPER_IDLE;
    }
    return;
  }

  const bool allowAutoStepper = DREAM_ENABLE_EEG_STEPPER_AUTO && systemEnabled && safetyState == SAFETY_NORMAL;
  if (!manualStepperActive && !allowAutoStepper) {
    stepperTargetSteps = stepperPositionSteps;
    stepperPulseActive = false;
    writeStepperStepPin(STEPPER_TARGET_SINGLE, HIGH);
    if (STEPPER_ENABLE_PIN >= 0) {
      digitalWrite(STEPPER_ENABLE_PIN, !STEPPER_ENABLE_ACTIVE_LEVEL);
    }
    stepperState = STEPPER_DISABLED;
    return;
  }

  if (STEPPER_ENABLE_PIN >= 0) {
    digitalWrite(STEPPER_ENABLE_PIN, STEPPER_ENABLE_ACTIVE_LEVEL);
  }

  if (manualStepperActive) {
    stepperState = STEPPER_MOVING;
    stepperTargetSteps = manualStepperTargetSteps;
  } else if (latestEegPacket.meditation >= STEPPER_MEDITATION_THRESHOLD) {
    stepperState = STEPPER_BREATHING;
    if (stepperPositionSteps >= STEPPER_MAX_POSITION_STEPS) {
      stepperBreathForward = false;
    } else if (stepperPositionSteps <= STEPPER_MIN_POSITION_STEPS) {
      stepperBreathForward = true;
    }
    stepperTargetSteps = stepperBreathForward ? STEPPER_MAX_POSITION_STEPS : STEPPER_MIN_POSITION_STEPS;
  } else if (latestEegPacket.attention >= STEPPER_ATTENTION_THRESHOLD) {
    stepperState = STEPPER_MOVING;
    stepperTargetSteps = STEPPER_MAX_POSITION_STEPS;
  } else {
    stepperTargetSteps = 0;
    stepperState = stepperTargetsReached() ? STEPPER_IDLE : STEPPER_MOVING;
  }

  const uint32_t nowUs = micros();
  const bool moving = updateSingleStepper(STEPPER_TARGET_SINGLE,
                                          stepperPositionSteps,
                                          stepperTargetSteps,
                                          lastStepperPulseUs,
                                          stepperPulseActive,
                                          nowUs);

  if (manualStepperActive) {
    if (stepperPositionSteps == manualStepperTargetSteps && !stepperPulseActive) {
      manualStepperMask = 0;
    }
    manualStepperActive = manualStepperMask != 0;
  }

  if (!moving) {
    stepperState = STEPPER_IDLE;
  }
#else
  stepperState = STEPPER_DISABLED;
#endif
}

void updateRelayController() {
#if DREAM_ENABLE_RELAY_OUTPUT
  const uint32_t now = millis();
  const bool bubbleActive = bubbleFlowActive();
  const bool manualOutputsAllowed = systemEnabled && !bubbleActive;
  const bool fogOn = bubbleFogOutputActive(now) || (manualOutputsAllowed && manualFogRequested);
  const bool fanOn = bubbleFanOutputActive(now) || (manualOutputsAllowed && manualFanRequested);

  digitalWrite(FOG_RELAY_PIN, fogOn ? RELAY_ACTIVE_LEVEL : !RELAY_ACTIVE_LEVEL);
  digitalWrite(FAN_RELAY_PIN, fanOn ? RELAY_ACTIVE_LEVEL : !RELAY_ACTIVE_LEVEL);
  relayState = fogOn ? RELAY_ON : RELAY_OFF;
  fanState = fanOn ? RELAY_ON : RELAY_OFF;
#else
  relayState = RELAY_OFF;
  fanState = RELAY_OFF;
#endif
}

void sendMicStatus() {
  if (!espNowReady) {
    return;
  }

