zzzz1121/A-dream/src/microduino_core_esp32_test/main.cpp
  DreamMicStatusPacket packet = {};
  packet.magic = DREAM_PACKET_MAGIC;
  packet.version = DREAM_PROTOCOL_VERSION;
  packet.type = DREAM_PACKET_MIC_STATUS;
  packet.seq = statusSeq++;
  packet.uptimeMs = millis();
  packet.lastEegSeq = haveEeg ? latestEegPacket.seq : 0;
  packet.eegAgeMs = haveEeg ? eegAgeMs() : 0xFFFFFFFFUL;
  packet.rxCount = eegRxCount;
  packet.dropCount = eegDropCount + eegChecksumErrorCount;
  packet.timeoutCount = eegTimeoutCount;
  packet.poorSignal = haveEeg ? latestEegPacket.poorSignal : 255;
  packet.attention = haveEeg ? latestEegPacket.attention : 0;
  packet.meditation = haveEeg ? latestEegPacket.meditation : 0;
  packet.lightLevel = lightLevel;
  packet.lightMode = lightMode;
  packet.light1R = light1Current.r;
  packet.light1G = light1Current.g;
  packet.light1B = light1Current.b;
  packet.light1W = light1Current.w;
  packet.light2R = light2Current.r;
  packet.light2G = light2Current.g;
  packet.light2B = light2Current.b;
  packet.light2W = light2Current.w;
  packet.stepperState = stepperState;
  packet.relayState = relayState;
  packet.safetyState = safetyState;
  packet.controlRxCount = controlRxCount;
  packet.lastControlAction = lastControlAction;
  packet.manualLightEnabled = manualLightEnabled ? 1 : 0;
  packet.relayOutputEnabled = DREAM_ENABLE_RELAY_OUTPUT ? 1 : 0;
  packet.stepperOutputEnabled = DREAM_ENABLE_STEPPER_OUTPUT ? 1 : 0;
  packet.systemEnabled = systemEnabled ? 1 : 0;
  packet.fanState = fanState;
  packet.bubbleState = bubbleState;
  packet.bubbleOutputEnabled = DREAM_ENABLE_RELAY_OUTPUT ? 1 : 0;
  packet.reserved2 = 0;
  packet.bubbleTriggerCount = bubbleTriggerCount;
  packet.bubbleActiveMs = currentBubbleActiveMs();
  packet.checksum = calculatePacketChecksum(packet);

  const esp_err_t result = esp_now_send(BROADCAST_MAC, reinterpret_cast<const uint8_t *>(&packet), sizeof(packet));
  if (result != ESP_OK) {
    Serial.print("EVENT=MIC_STATUS_SEND_FAIL ERR=");
    Serial.println(result);
  }
}

void printStatus() {
  Serial.print("EVENT=MIC_STATUS RX=");
  Serial.print(eegRxCount);
  Serial.print(" DROP=");
  Serial.print(eegDropCount);
  Serial.print(" CHECKSUM_ERR=");
  Serial.print(eegChecksumErrorCount);
  Serial.print(" TIMEOUT=");
  Serial.print(eegTimeoutCount);
  Serial.print(" CONTROL_RX=");
  Serial.print(controlRxCount);
  Serial.print(" CONTROL_CHECKSUM_ERR=");
  Serial.print(controlChecksumErrorCount);
  Serial.print(" EEG_AGE_MS=");
  Serial.print(haveEeg ? eegAgeMs() : 0);
  Serial.print(" LIGHT_MODE=");
  Serial.print(lightMode);
  Serial.print(" LIGHT_LEVEL=");
  Serial.print(lightLevel);
  Serial.print(" DMX_FRAMES=");
  Serial.print(dmxFrameCount);
  Serial.print(" DMX_WRITE=");
  Serial.print(lastDmxWriteSize);
  Serial.print(" DMX_SEND=");
  Serial.print(lastDmxSendSize);
  Serial.print(" DMX_SEND_FAIL=");
  Serial.print(dmxSendFailCount);
  Serial.print(" DMX_WAIT_FAIL=");
  Serial.print(dmxWaitFailCount);
  Serial.print(" L1_RGBW=");
  Serial.print(light1Current.r);
  Serial.print(",");
  Serial.print(light1Current.g);
  Serial.print(",");
  Serial.print(light1Current.b);
  Serial.print(",");
  Serial.print(light1Current.w);
  Serial.print(" L2_RGBW=");
  Serial.print(light2Current.r);
  Serial.print(",");
  Serial.print(light2Current.g);
  Serial.print(",");
  Serial.print(light2Current.b);
  Serial.print(",");
  Serial.print(light2Current.w);
  Serial.print(" STEPPER=");
  Serial.print(stepperState);
#if DREAM_ENABLE_STEPPER_OUTPUT
  Serial.print(" STEPPER_POS=");
  Serial.print(stepperPositionSteps);
  Serial.print(" STEPPER_TARGET=");
  Serial.print(stepperTargetSteps);
  Serial.print(" STEPPER_MANUAL_MASK=");
  Serial.print(manualStepperMask);
#endif
  Serial.print(" RELAY=");
  Serial.print(relayState);
  Serial.print(" FAN=");
  Serial.print(fanState);
  Serial.print(" BUBBLE=");
  Serial.print(bubbleState);
  Serial.print(" BUBBLE_COUNT=");
  Serial.print(bubbleTriggerCount);
  Serial.print(" BUBBLE_ACTIVE_MS=");
  Serial.print(currentBubbleActiveMs());
  Serial.print(" SAFETY=");
  Serial.print(safetyState);
  Serial.print(" LAST_ACTION=");
  Serial.print(lastControlAction);
  Serial.print(" MANUAL_LIGHT=");
  Serial.print(manualLightEnabled ? 1 : 0);
  Serial.print(" RELAY_OUTPUT_ENABLED=");
  Serial.print(DREAM_ENABLE_RELAY_OUTPUT ? 1 : 0);
  Serial.print(" STEPPER_OUTPUT_ENABLED=");
  Serial.print(DREAM_ENABLE_STEPPER_OUTPUT ? 1 : 0);
  Serial.print(" BUBBLE_OUTPUT_ENABLED=");
  Serial.print(DREAM_ENABLE_RELAY_OUTPUT ? 1 : 0);
  Serial.print(" SYSTEM_ENABLED=");
  Serial.println(systemEnabled ? 1 : 0);
}

void setup() {
  Serial.begin(SERIAL_BAUD);
  delay(300);

  latestEegPacket.poorSignal = 255;

  Serial.println();
  Serial.print("EVENT=DREAM_BOOT BOARD=");
  Serial.print(BOARD_NAME);
  Serial.print(" ROLE=");
  Serial.print(DEVICE_ROLE);
  Serial.print(" VERSION=");
  Serial.println(MIC_CONTROLLER_VERSION);

  initDmx();
  initStepper();
  initRelay();
  initEspNow();
}

void loop() {
  updateSafetyState();
  updateStepperController();
  updateBubbleTimeline();
  updateRelayController();
  updateLightController();

  const uint32_t now = millis();
  if (now - lastStatusSendMs >= STATUS_SEND_MS) {
    lastStatusSendMs = now;
    sendMicStatus();
  }

  if (now - lastStatusPrintMs >= STATUS_PRINT_MS) {
    lastStatusPrintMs = now;
    printStatus();
  }
}
